# 实习三 SQL机器学习
小组成员：郝泽成 蔡亚伦 赵泽骏

In [1]:
%load_ext sql
import pymysql 
pymysql.install_as_MySQLdb()

In [2]:
%sql mysql://stu2000012974:stu2000012974@162.105.146.37:43306

In [3]:
%sql show databases;

 * mysql://stu2000012974:***@162.105.146.37:43306
4 rows affected.

[('dataset',), ('information_schema',), ('mysql',), ('stu2000012974',)]

## 练习一  各种熵的SQL实现

In [4]:
%sql use dataset;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [5]:
%sql show tables;

 * mysql://stu2000012974:***@162.105.146.37:43306
12 rows affected.

[('TheWorldHappinessReport2015',),
 ('TheWorldHappinessReport2016',),
 ('TheWorldHappinessReport2017',),
 ('TheWorldHappinessReport2018',),
 ('TheWorldHappinessReport2019',),
 ('itemscore',),
 ('movieGenres',),
 ('movies',),
 ('ratings',),
 ('supermarketTrans',),
 ('tags',),
 ('xzqh',)]

In [6]:
%sql SELECT * FROM TheWorldHappinessReport2015 limit 10;

 * mysql://stu2000012974:***@162.105.146.37:43306
10 rows affected.

[(0, 'Switzerland', 1, 7.587, 1.39651, 0.94143, 0.66557, 0.41978, 0.29678, 2015),
 (1, 'Iceland', 2, 7.561, 1.30232, 0.94784, 0.62877, 0.14145, 0.4363, 2015),
 (2, 'Denmark', 3, 7.527, 1.32548, 0.87464, 0.64938, 0.48357, 0.34139, 2015),
 (3, 'Norway', 4, 7.522, 1.459, 0.88521, 0.66973, 0.36503, 0.34699, 2015),
 (4, 'Canada', 5, 7.427, 1.32629, 0.90563, 0.63297, 0.32957, 0.45811, 2015),
 (5, 'Finland', 6, 7.406, 1.29025, 0.88911, 0.64169, 0.41372, 0.23351, 2015),
 (6, 'Netherlands', 7, 7.378, 1.32944, 0.89284, 0.61576, 0.31814, 0.4761, 2015),
 (7, 'Sweden', 8, 7.364, 1.33171, 0.91087, 0.6598, 0.43844, 0.36262, 2015),
 (8, 'New Zealand', 9, 7.286, 1.25018, 0.90837, 0.63938, 0.42922, 0.47501, 2015),
 (9, 'Australia', 10, 7.284, 1.33358, 0.93156, 0.65124, 0.35637, 0.43562, 2015)]

In [7]:
%sql use stu2000012974;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

### 数据预处理
拷贝一份表，并对表中数据进行预处理方便后续的计算。

具体处理方法为，对同一列中的每个数据，都用其除以这一列的最大数，再舍入到一位小数，处理后取值范围为0.0-1.0共11个离散的DOUBLE类型值。

In [8]:
%sql CREATE TABLE TheWorldHappinessReport2015 LIKE dataset.TheWorldHappinessReport2015;
%sql INSERT TheWorldHappinessReport2015 SELECT * FROM dataset.TheWorldHappinessReport2015;
%sql CREATE TABLE newTheWorldHappinessReport2015 LIKE TheWorldHappinessReport2015;
%sql INSERT newTheWorldHappinessReport2015 SELECT id,region,_rank,ROUND(happiness/7.587,1),ROUND(gdp_per_capita/1.69042,1),ROUND(healthy_life_expectancy/1.02525,1),ROUND(freedom_to_life_choise/0.66973,1),ROUND(corruption_perceptions/0.55191,1),ROUND(generosity/0.79588,1),year from TheWorldHappinessReport2015;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
158 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
158 rows affected.

[]

In [9]:
%sql SELECT * FROM newTheWorldHappinessReport2015 limit 10;

 * mysql://stu2000012974:***@162.105.146.37:43306
10 rows affected.

[(0, 'Switzerland', 1, 1.0, 0.8, 0.9, 1.0, 0.8, 0.4, 2015),
 (1, 'Iceland', 2, 1.0, 0.8, 0.9, 0.9, 0.3, 0.5, 2015),
 (2, 'Denmark', 3, 1.0, 0.8, 0.9, 1.0, 0.9, 0.4, 2015),
 (3, 'Norway', 4, 1.0, 0.9, 0.9, 1.0, 0.7, 0.4, 2015),
 (4, 'Canada', 5, 1.0, 0.8, 0.9, 0.9, 0.6, 0.6, 2015),
 (5, 'Finland', 6, 1.0, 0.8, 0.9, 1.0, 0.7, 0.3, 2015),
 (6, 'Netherlands', 7, 1.0, 0.8, 0.9, 0.9, 0.6, 0.6, 2015),
 (7, 'Sweden', 8, 1.0, 0.8, 0.9, 1.0, 0.8, 0.5, 2015),
 (8, 'New Zealand', 9, 1.0, 0.7, 0.9, 1.0, 0.8, 0.6, 2015),
 (9, 'Australia', 10, 1.0, 0.8, 0.9, 1.0, 0.6, 0.5, 2015)]

### 创建表
存储计算结果

In [10]:
%sql CREATE TABLE entropy (tab VARCHAR(100) NOT NULL,col VARCHAR(100) NOT NULL,entropy DOUBLE NOT NULL,PRIMARY KEY(tab,col));

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [11]:
%sql CREATE TABLE conditional_entropy (tab VARCHAR(100),cond_col VARCHAR(100),col VARCHAR(100),cond_entropy DOUBLE)

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [12]:
%sql CREATE TABLE relative_entropy (tab VARCHAR(100),rela_col VARCHAR(100),col VARCHAR(100),rela_entropy DOUBLE);

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

### 定义存储过程
有几点需要注意：
- WHERE子句中判断浮点数相等时需要采取对差值取绝对值和小数比较的方式，原因是浮点数的存储方式并不是精确的
- 区分用户变量和局部变量，在同一会话中用户变量不会自动清零，需要手动在合适的地方清零
- 注意计算LOG2(x)时判断x是否为零做合适的处理

In [13]:
%%sql
CREATE PROCEDURE CAL_ENTROPY (IN $TABNAME VARCHAR(100),IN $COLNAME VARCHAR(100))
BEGIN
DECLARE I DOUBLE DEFAULT 0.0;
DECLARE ANS DOUBLE DEFAULT 0.0;
SET @NUM=0;
SET @TOT=0;
SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," INTO @TOT");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
WHILE I<=1.0 DO
    SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," WHERE ABS(",$COLNAME,"-",I,")<1E-5 INTO @NUM");
    PREPARE QUERY FROM @SQL;
    EXECUTE QUERY;
    DEALLOCATE PREPARE QUERY;
    IF (@NUM<>0) THEN
        SET ANS=ANS-(@NUM/@TOT)*LOG2(@NUM/@TOT);
    END IF;
    SET I=I+0.1;
END WHILE;
SET @SQL=CONCAT("INSERT INTO entropy(tab,col,entropy) VALUES('",$TABNAME,"','",$COLNAME,"',",ANS,")");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
END;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [14]:
%%sql
CREATE PROCEDURE CAL_CONDITIONAL_ENTROPY (IN $TABNAME VARCHAR(100),IN $COND_COLNAME VARCHAR(100),IN $COLNAME VARCHAR(100))
BEGIN
DECLARE ANS DOUBLE DEFAULT 0.0;
DECLARE I DOUBLE DEFAULT 0.0;
DECLARE J DOUBLE DEFAULT 0.0;
DECLARE SUM DOUBLE DEFAULT 0.0;
SET @TOT=0;
SET @COND_TOT=0;
SET @COND_NUM=0;
SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," INTO @TOT");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
WHILE I<=1.0 DO
    SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," WHERE ABS(",$COND_COLNAME,"-",I,")<1E-5 INTO @COND_TOT");
    PREPARE QUERY FROM @SQL;
    EXECUTE QUERY;
    DEALLOCATE PREPARE QUERY;
    SET J=0.0;
    WHILE J<=1.0 DO
        SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," WHERE ABS(",$COLNAME,"-",J,")<1E-5 AND ABS(",$COND_COLNAME,"-",I,")<1E-5 INTO @COND_NUM");
        PREPARE QUERY FROM @SQL;
        EXECUTE QUERY;
        DEALLOCATE PREPARE QUERY;
        IF (@COND_NUM<>0) THEN
            SET SUM=SUM+(@COND_NUM/@COND_TOT)*LOG2(@COND_NUM/@COND_TOT);
        END IF;
        SET J=J+0.1;
    END WHILE;
    SET ANS=ANS-SUM*(@COND_TOT/@TOT);
    SET SUM=0;
    SET I=I+0.1;
END WHILE;
SET @SQL=CONCAT("INSERT INTO conditional_entropy(tab,cond_col,col,cond_entropy) VALUES('",$TABNAME,"','",$COND_COLNAME,"','",$COLNAME,"',",ANS,")");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
END;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [15]:
%%sql
CREATE PROCEDURE CAL_RELATIVE_ENTROPY (IN $TABNAME VARCHAR(100),IN $RELA_COLNAME VARCHAR(100),IN $COLNAME VARCHAR(100))
BEGIN
DECLARE I DOUBLE DEFAULT 0.0;
DECLARE ANS DOUBLE DEFAULT 0.0;
SET @TOT=0;
SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," INTO @TOT");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
outer_label:WHILE I<=1.0 DO
    SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," WHERE ABS(",$RELA_COLNAME,"-",I,")<1E-5 INTO @RELA_NUM1");
    PREPARE QUERY FROM @SQL;
    EXECUTE QUERY;
    DEALLOCATE PREPARE QUERY;
    IF (@RELA_NUM1=0) THEN
        SET ANS=9999999999;
        LEAVE outer_label;
    END IF;
    SET @SQL=CONCAT("SELECT COUNT(*) FROM ",$TABNAME," WHERE ABS(",$COLNAME,"-",I,")<1E-5 INTO @RELA_NUM2");
    PREPARE QUERY FROM @SQL;
    EXECUTE QUERY;
    DEALLOCATE PREPARE QUERY;
    IF (@RELA_NUM2<>0) THEN
        SET ANS=ANS+(@RELA_NUM2/@TOT)*LOG2(@RELA_NUM2/@RELA_NUM1);
    END IF;
    SET I=I+0.1;
END WHILE outer_label;
SET @SQL=CONCAT("INSERT INTO relative_entropy(tab,rela_col,col,rela_entropy) VALUES('",$TABNAME,"','",$RELA_COLNAME,"','",$COLNAME,"',",ANS,")");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
END;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

### 测试
这里选取部分样例进行测试，详见具体调用语句。

In [16]:
%sql CALL CAL_ENTROPY("newTheWorldHappinessReport2015","happiness");
%sql CALL CAL_ENTROPY("newTheWorldHappinessReport2015","gdp_per_capita");
%sql CALL CAL_ENTROPY("newTheWorldHappinessReport2015","healthy_life_expectancy");
%sql CALL CAL_ENTROPY("newTheWorldHappinessReport2015","freedom_to_life_choise");
%sql CALL CAL_ENTROPY("newTheWorldHappinessReport2015","corruption_perceptions");
%sql CALL CAL_ENTROPY("newTheWorldHappinessReport2015","generosity");

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [17]:
%sql SELECT * FROM entropy;

 * mysql://stu2000012974:***@162.105.146.37:43306
6 rows affected.

[('newTheWorldHappinessReport2015', 'corruption_perceptions', 2.7841991572769165),
 ('newTheWorldHappinessReport2015', 'freedom_to_life_choise', 3.1290989778028804),
 ('newTheWorldHappinessReport2015', 'gdp_per_capita', 3.180047045310024),
 ('newTheWorldHappinessReport2015', 'generosity', 2.6121564363804204),
 ('newTheWorldHappinessReport2015', 'happiness', 2.600141041600236),
 ('newTheWorldHappinessReport2015', 'healthy_life_expectancy', 3.069965118125868)]

In [18]:
%sql CALL CAL_CONDITIONAL_ENTROPY("newTheWorldHappinessReport2015","gdp_per_capita","happiness");
%sql CALL CAL_CONDITIONAL_ENTROPY("newTheWorldHappinessReport2015","healthy_life_expectancy","happiness");
%sql CALL CAL_CONDITIONAL_ENTROPY("newTheWorldHappinessReport2015","freedom_to_life_choise","happiness");
%sql CALL CAL_CONDITIONAL_ENTROPY("newTheWorldHappinessReport2015","corruption_perceptions","happiness");
%sql CALL CAL_CONDITIONAL_ENTROPY("newTheWorldHappinessReport2015","generosity","happiness");

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [19]:
%sql SELECT * FROM conditional_entropy;

 * mysql://stu2000012974:***@162.105.146.37:43306
5 rows affected.

[('newTheWorldHappinessReport2015', 'gdp_per_capita', 'happiness', 1.7791650324592223),
 ('newTheWorldHappinessReport2015', 'healthy_life_expectancy', 'happiness', 1.8210589757688016),
 ('newTheWorldHappinessReport2015', 'freedom_to_life_choise', 'happiness', 2.047772555376436),
 ('newTheWorldHappinessReport2015', 'corruption_perceptions', 'happiness', 2.1712333830399353),
 ('newTheWorldHappinessReport2015', 'generosity', 'happiness', 2.2944621057580386)]

In [20]:
%sql CALL CAL_RELATIVE_ENTROPY("newTheWorldHappinessReport2015","gdp_per_capita","happiness");
%sql CALL CAL_RELATIVE_ENTROPY("newTheWorldHappinessReport2015","healthy_life_expectancy","happiness");
%sql CALL CAL_RELATIVE_ENTROPY("newTheWorldHappinessReport2015","freedom_to_life_choise","happiness");
%sql CALL CAL_RELATIVE_ENTROPY("newTheWorldHappinessReport2015","corruption_perceptions","happiness");
%sql CALL CAL_RELATIVE_ENTROPY("newTheWorldHappinessReport2015","generosity","happiness");

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [21]:
%sql SELECT * FROM relative_entropy;

 * mysql://stu2000012974:***@162.105.146.37:43306
5 rows affected.

[('newTheWorldHappinessReport2015', 'gdp_per_capita', 'happiness', 0.878296083242887),
 ('newTheWorldHappinessReport2015', 'healthy_life_expectancy', 'happiness', 0.5165570524858637),
 ('newTheWorldHappinessReport2015', 'freedom_to_life_choise', 'happiness', 0.27339277620143926),
 ('newTheWorldHappinessReport2015', 'corruption_perceptions', 'happiness', 2.5799056114345227),
 ('newTheWorldHappinessReport2015', 'generosity', 'happiness', 0.7999999999999999)]

### 相关性的分析
这里采用计算信息增益的方法，信息增益越大相关性越强。

从结果可以看出，按对happiness的影响从强到弱排序依次为：
1. gdp_per_capita
2. healthy_life_expectancy
3. freedom_to_life_choise
4. corruption_perceptions
5. generosity。

In [22]:
%%sql 
SELECT entropy.col col,entropy-cond_entropy AS 'KL-Divergence' 
FROM entropy,conditional_entropy 
WHERE entropy.col=conditional_entropy.cond_col 
ORDER BY entropy-cond_entropy desc;

 * mysql://stu2000012974:***@162.105.146.37:43306
5 rows affected.

[('gdp_per_capita', 1.4008820128508015),
 ('healthy_life_expectancy', 1.2489061423570664),
 ('freedom_to_life_choise', 1.0813264224264443),
 ('corruption_perceptions', 0.6129657742369812),
 ('generosity', 0.31769433062238184)]

### 复原

In [23]:
%sql DROP PROCEDURE CAL_ENTROPY;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [24]:
%sql DROP PROCEDURE CAL_CONDITIONAL_ENTROPY;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [25]:
%sql DROP PROCEDURE CAL_RELATIVE_ENTROPY;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [26]:
%sql DROP TABLE entropy;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [27]:
%sql DROP TABLE conditional_entropy;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [28]:
%sql DROP TABLE relative_entropy;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [29]:
%sql DROP TABLE newTheWorldHappinessReport2015;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [30]:
%sql DROP TABLE TheWorldHappinessReport2015;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

## 练习二 AUC计算

In [31]:
%sql use dataset;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [32]:
%sql select * from itemscore limit 100;

 * mysql://stu2000012974:***@162.105.146.37:43306
100 rows affected.

[(0.1103, -1.0),
 (0.1708, -1.0),
 (0.2887, 1.0),
 (0.0861, -1.0),
 (0.1009, 1.0),
 (0.4262, -1.0),
 (0.1034, -1.0),
 (0.1923, -1.0),
 (0.3172, -1.0),
 (0.1022, -1.0),
 (0.2067, -1.0),
 (0.0866, -1.0),
 (0.3532, -1.0),
 (0.0996, -1.0),
 (0.4384, 1.0),
 (0.9337, -1.0),
 (0.9039, 1.0),
 (0.0974, -1.0),
 (0.3715, -1.0),
 (0.3739, -1.0),
 (0.4426, -1.0),
 (0.2078, -1.0),
 (0.2046, -1.0),
 (0.0818, -1.0),
 (0.2078, -1.0),
 (0.304, -1.0),
 (0.2457, -1.0),
 (0.2096, -1.0),
 (0.0838, -1.0),
 (0.2457, -1.0),
 (0.213, -1.0),
 (0.1161, -1.0),
 (0.213, -1.0),
 (0.1414, -1.0),
 (0.3634, -1.0),
 (0.1161, -1.0),
 (0.1812, -1.0),
 (0.0931, 1.0),
 (0.303, -1.0),
 (0.1678, -1.0),
 (0.1127, -1.0),
 (0.4712, -1.0),
 (0.1118, -1.0),
 (0.1276, -1.0),
 (0.1257, -1.0),
 (0.4712, -1.0),
 (0.1865, -1.0),
 (0.2799, 1.0),
 (0.164, -1.0),
 (0.1678, -1.0),
 (0.2553, -1.0),
 (0.057, -1.0),
 (0.1188, -1.0),
 (0.3931, -1.0),
 (0.1755, -1.0),
 (0.115, -1.0),
 (0.1334, -1.0),
 (0.1177, -1.0),
 (0.2536, -1.0),
 (0.0725, -1.0),
 (0.408, -1.0),
 (0.1154, -1.0),
 (0.1464, -1.0),
 (0.1367, -1.0),
 (0.1274, -1.0),
 (0.1317, -1.0),
 (0.1488, -1.0),
 (0.1535, 1.0),
 (0.1143, -1.0),
 (0.1488, -1.0),
 (0.2324, 1.0),
 (0.0627, -1.0),
 (0.1782, -1.0),
 (0.3831, 1.0),
 (0.3449, 1.0),
 (0.6092, 1.0),
 (0.3263, -1.0),
 (0.7859, 1.0),
 (0.2893, -1.0),
 (0.0466, -1.0),
 (0.1673, -1.0),
 (0.074, -1.0),
 (0.0501, -1.0),
 (0.1317, -1.0),
 (0.1236, 1.0),
 (0.074, -1.0),
 (0.2425, 1.0),
 (0.1026, -1.0),
 (0.2085, -1.0),
 (0.1612, -1.0),
 (0.2015, 1.0),
 (0.0335, 1.0),
 (0.1224, -1.0),
 (0.0851, -1.0),
 (0.7916, 1.0),
 (0.1292, -1.0),
 (0.1759, -1.0),
 (0.1502, 1.0),
 (0.0627, -1.0),
 (0.3426, 1.0)]

In [33]:
%sql use stu2000012974;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

采用[实习题目提供资料](https://zhuanlan.zhihu.com/p/443260433
)中的第二种方法

In [34]:
%%sql
SELECT (POS_RANK_SUM-0.5*TOT_POS*(TOT_POS+1))/(TOT_POS*TOT_NEG) AS AUC
FROM (SELECT SUM(CASE WHEN c2=-1.0 THEN 1 ELSE 0 END) AS TOT_NEG,
             SUM(CASE WHEN c2=1.0 THEN 1 ELSE 0 END) AS TOT_POS,
             SUM(CASE WHEN c2=1.0 THEN c1_rank ELSE 0 END) AS POS_RANK_SUM 
      FROM (SELECT c1,
                   c2,
                   ROW_NUMBER() OVER(ORDER BY c1 ASC) AS c1_rank 
            FROM dataset.itemscore) AS TAB1) AS TAB2;

 * mysql://stu2000012974:***@162.105.146.37:43306
1 rows affected.

[(Decimal('0.74792'),)]

## 练习三 贝叶斯分类

In [39]:
%sql use stu2000012974;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

### 构建buyComputer数据集

In [40]:
%%sql 
create table buyComputer(age int, income char(10), student char(5), credit_rating char(15), buys_computer char(5));
insert into buyComputer values
(30,'high','no','fair','no'),(30,'high','no','excellent','no'),(40,'high','no','fair','yes'),
(50,'medium','no','fair','yes'),(50,'low','yes','fair','yes'),(50,'low','yes','excellent','no'),
(40,'low','yes','excellent','yes'),(30,'medium','no','fair','no'),(30,'low','yes','fair','yes'),
(50,'medium','yes','fair','yes'),(30,'medium','yes','excellent','yes'),(40,'medium','no','excellent','yes'),
(40,'high','yes','fair','yes'),(50,'medium','no','excellent','no');

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
14 rows affected.

[]

In [41]:
%sql select * from buyComputer;

 * mysql://stu2000012974:***@162.105.146.37:43306
14 rows affected.

[(30, 'high', 'no', 'fair', 'no'),
 (30, 'high', 'no', 'excellent', 'no'),
 (40, 'high', 'no', 'fair', 'yes'),
 (50, 'medium', 'no', 'fair', 'yes'),
 (50, 'low', 'yes', 'fair', 'yes'),
 (50, 'low', 'yes', 'excellent', 'no'),
 (40, 'low', 'yes', 'excellent', 'yes'),
 (30, 'medium', 'no', 'fair', 'no'),
 (30, 'low', 'yes', 'fair', 'yes'),
 (50, 'medium', 'yes', 'fair', 'yes'),
 (30, 'medium', 'yes', 'excellent', 'yes'),
 (40, 'medium', 'no', 'excellent', 'yes'),
 (40, 'high', 'yes', 'fair', 'yes'),
 (50, 'medium', 'no', 'excellent', 'no')]

### 构建表存储结果

In [42]:
%sql create table predict(age int, income char(10), student char(5), credit_rating char(15), buys_computer char(5),primary key(age,income,student,credit_rating));

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

### 定义存储过程

In [43]:
%%sql
CREATE PROCEDURE PREDICT (IN $AGE INT,IN $INCOME CHAR(10),IN $STUDENT CHAR(5),IN $CREDIT_RATING CHAR(15))
BEGIN
DECLARE TOT DOUBLE DEFAULT 0;
DECLARE YES DOUBLE DEFAULT 0;
DECLARE NO DOUBLE DEFAULT 0;
DECLARE X_YES DOUBLE DEFAULT 0;
DECLARE X_NO DOUBLE DEFAULT 0;
SET @AGE_YES=0;
SET @AGE_NO=0;
SET @INCOME_YES=0;
SET @INCOME_NO=0;
SET @STUDENT_YES=0;
SET @STUDENT_NO=0;
SET @CREDIT_RATING_YES=0;
SET @CREDIT_RATING_NO=0;
SELECT COUNT(*) FROM buyComputer INTO TOT;
SELECT COUNT(*) FROM buyComputer WHERE buys_computer="yes" INTO YES;
SELECT COUNT(*) FROM buyComputer WHERE buys_computer="no" INTO NO;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='yes' and age=",$AGE," INTO @AGE_YES");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='no' and age=",$AGE," INTO @AGE_NO");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='yes' and income='",$INCOME,"' INTO @INCOME_YES");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='no' and income='",$INCOME,"' INTO @INCOME_NO");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='yes' and student='",$STUDENT,"' INTO @STUDENT_YES");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='no' and student='",$STUDENT,"' INTO @STUDENT_NO");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='yes' and credit_rating='",$CREDIT_RATING,"' INTO @CREDIT_RATING_YES");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET @SQL=CONCAT("SELECT COUNT(*) FROM buyComputer WHERE buys_computer='no' and credit_rating='",$CREDIT_RATING,"' INTO @CREDIT_RATING_NO");
PREPARE QUERY FROM @SQL;
EXECUTE QUERY;
DEALLOCATE PREPARE QUERY;
SET X_YES=@AGE_YES*@INCOME_YES*@STUDENT_YES*@CREDIT_RATING_YES/(YES*YES*YES*YES);
SET X_NO=@AGE_NO*@INCOME_NO*@STUDENT_NO*@CREDIT_RATING_NO/(NO*NO*NO*NO);
SET YES=YES/TOT;
SET NO=NO/TOT;
IF (X_YES*YES>X_NO*NO) THEN
    SET @SQL=CONCAT("INSERT INTO predict(age,income,student,credit_rating,buys_computer) VALUES(",$AGE,",'",$INCOME,"','",$STUDENT,"','",$CREDIT_RATING,"','yes')");
    PREPARE QUERY FROM @SQL;
    EXECUTE QUERY;
    DEALLOCATE PREPARE QUERY;
ELSE
    SET @SQL=CONCAT("INSERT INTO predict(age,income,student,credit_rating,buys_computer) VALUES(",$AGE,",'",$INCOME,"','",$STUDENT,"','",$CREDIT_RATING,"','no')");
    PREPARE QUERY FROM @SQL;
    EXECUTE QUERY;
    DEALLOCATE PREPARE QUERY;
END IF;
END;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

### 测试

In [44]:
%sql CALL PREDICT(30,"high","no","fair");
%sql CALL PREDICT(40,"medium","yes","excellent");
%sql CALL PREDICT(30,"low","yes","fair");
%sql CALL PREDICT(50,"high","no","excellent");

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [45]:
%sql select * from predict;

 * mysql://stu2000012974:***@162.105.146.37:43306
4 rows affected.

[(30, 'high', 'no', 'fair', 'no'),
 (30, 'low', 'yes', 'fair', 'yes'),
 (40, 'medium', 'yes', 'excellent', 'yes'),
 (50, 'high', 'no', 'excellent', 'no')]

### 复原

In [46]:
%sql DROP PROCEDURE PREDICT;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

In [47]:
%sql DROP TABLE predict;
%sql DROP TABLE buyComputer;

 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu2000012974:***@162.105.146.37:43306
0 rows affected.

[]

## 练习四 决策树中的信息增益计算

In [1]:
%load_ext sql

In [2]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu1900012992:stu1900012992@162.105.146.37:43306

In [3]:
%sql show databases

 * mysql://stu1900012992:***@162.105.146.37:43306
4 rows affected.

[('dataset',), ('information_schema',), ('mysql',), ('stu1900012992',)]

In [4]:
%sql use stu1900012992;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [5]:
%%sql
create table Egg (鸡蛋编号 int, 照射 char(10), 摇晃 char(10), 盐水 char(10), 类标签 char(10));

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [6]:
%%sql
insert into Egg values 
(1,'透明','不摇','沉','好'),
(2,'透明','不摇','沉','好'),
(3,'透明','不摇','沉','好'),
(4,'透明','不摇','沉','好'),
(5,'透明','不摇','沉','好'),
(6,'浑浊','不摇','沉','好'),
(7,'浑浊','不摇','沉','坏'),
(8,'透明','不摇','浮','坏'),
(9,'浑浊','摇','浮','坏'),
(10,'浑浊','摇','浮','坏');

 * mysql://stu1900012992:***@162.105.146.37:43306
10 rows affected.

[]

In [7]:
%%sql
select * from Egg;

 * mysql://stu1900012992:***@162.105.146.37:43306
10 rows affected.

[(1, '透明', '不摇', '沉', '好'),
 (2, '透明', '不摇', '沉', '好'),
 (3, '透明', '不摇', '沉', '好'),
 (4, '透明', '不摇', '沉', '好'),
 (5, '透明', '不摇', '沉', '好'),
 (6, '浑浊', '不摇', '沉', '好'),
 (7, '浑浊', '不摇', '沉', '坏'),
 (8, '透明', '不摇', '浮', '坏'),
 (9, '浑浊', '摇', '浮', '坏'),
 (10, '浑浊', '摇', '浮', '坏')]

由于对数的真数要求大于0，所欲我们编写LO(X)函数，如果X>0则直接返回LOG2(X)，

否则返回0（这是因为xlogx在x从大于0方向趋向于0时其极限值为0）

In [8]:
%%sql
CREATE FUNCTION LO (X DOUBLE) RETURNS DOUBLE
BEGIN
DECLARE Z DOUBLE;
SET Z=0;
IF (X>0) THEN 
SET Z=LOG2(X);
END IF;
RETURN Z;
END

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [9]:
%%sql
CREATE FUNCTION F (NAME VARCHAR(20)) RETURNS DOUBLE
BEGIN
DECLARE Z DOUBLE;
DECLARE ZG DOUBLE;
DECLARE ZB DOUBLE;
DECLARE ZSZ DOUBLE;
DECLARE ZSF DOUBLE;
DECLARE ZSZG DOUBLE;
DECLARE ZSZB DOUBLE;
DECLARE ZSFG DOUBLE;
DECLARE ZSFB DOUBLE;
DECLARE I DOUBLE;
DECLARE E DOUBLE;
DECLARE ANS DOUBLE;
SELECT COUNT(*) FROM Egg WHERE 类标签="好" INTO ZG;
SELECT COUNT(*) FROM Egg WHERE 类标签="坏" INTO ZB;
SET Z=ZG+ZB;
SET I=-((ZG/Z)*LOG2(ZG/Z)+(ZB/Z)*LOG2(ZB/Z));
IF (NAME ="照射") THEN
    SELECT COUNT(*) FROM Egg WHERE 类标签="好" AND 照射="透明" INTO ZSZG;
    SELECT COUNT(*) FROM Egg WHERE 类标签="坏" AND 照射="透明" INTO ZSZB;
    SELECT COUNT(*) FROM Egg WHERE 类标签="好" AND 照射="浑浊" INTO ZSFG;
    SELECT COUNT(*) FROM Egg WHERE 类标签="坏" AND 照射="浑浊" INTO ZSFB;
    SELECT COUNT(*) FROM Egg WHERE 照射="透明" INTO ZSZ;
    SELECT COUNT(*) FROM Egg WHERE 照射="浑浊" INTO ZSF;
    #SET E=((ZSZG/ZSZ)*LOG2(ZSZG/ZSZ)+(ZSZB/ZSZ)*LOG2(ZSZB/ZSZ))*(ZSZ/Z);
    SET E=-(((ZSZG/ZSZ)*LO(ZSZG/ZSZ)+(ZSZB/ZSZ)*LO(ZSZB/ZSZ))*(ZSZ/Z)
            +((ZSFG/ZSF)*LO(ZSFG/ZSF)+(ZSFB/ZSF)*LO(ZSFB/ZSF))*(ZSF/Z));
END IF;   
IF (NAME ="摇晃") THEN
    SELECT COUNT(*) FROM Egg WHERE 类标签="好" AND 摇晃="不摇" INTO ZSZG;
    SELECT COUNT(*) FROM Egg WHERE 类标签="坏" AND 摇晃="不摇" INTO ZSZB;
    SELECT COUNT(*) FROM Egg WHERE 类标签="好" AND 摇晃="摇" INTO ZSFG;
    SELECT COUNT(*) FROM Egg WHERE 类标签="坏" AND 摇晃="摇" INTO ZSFB;
    SELECT COUNT(*) FROM Egg WHERE 摇晃="不摇" INTO ZSZ;
    SELECT COUNT(*) FROM Egg WHERE 摇晃="摇" INTO ZSF;
    SET E=-(((ZSZG/ZSZ)*LO(ZSZG/ZSZ)+(ZSZB/ZSZ)*LO(ZSZB/ZSZ))*(ZSZ/Z)
            +((ZSFG/ZSF)*LO(ZSFG/ZSF)+(ZSFB/ZSF)*LO(ZSFB/ZSF))*(ZSF/Z));
END IF; 
IF (NAME ="盐水") THEN
    SELECT COUNT(*) FROM Egg WHERE 类标签="好" AND 盐水="沉" INTO ZSZG;
    SELECT COUNT(*) FROM Egg WHERE 类标签="坏" AND 盐水="沉" INTO ZSZB;
    SELECT COUNT(*) FROM Egg WHERE 类标签="好" AND 盐水="浮" INTO ZSFG;
    SELECT COUNT(*) FROM Egg WHERE 类标签="坏" AND 盐水="浮" INTO ZSFB;
    SELECT COUNT(*) FROM Egg WHERE 盐水="沉" INTO ZSZ;
    SELECT COUNT(*) FROM Egg WHERE 盐水="浮" INTO ZSF;
    SET E=-(((ZSZG/ZSZ)*LO(ZSZG/ZSZ)+(ZSZB/ZSZ)*LO(ZSZB/ZSZ))*(ZSZ/Z)
            +((ZSFG/ZSF)*LO(ZSFG/ZSF)+(ZSFB/ZSF)*LO(ZSFB/ZSF))*(ZSF/Z));
END IF;
SET ANS=I-E;
RETURN ANS;
END;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

我们把答案放到这张表里

In [10]:
%%sql
create table ANSWER (属性 VARCHAR(20),答案  DOUBLE);

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [11]:
%%sql
insert into ANSWER values 
("照射",F("照射")),
("摇晃",F("摇晃")),
("盐水",F("盐水"));

 * mysql://stu1900012992:***@162.105.146.37:43306
3 rows affected.

[]

下面显示答案，可见我的答案是对的

In [12]:
%%sql
SELECT * FROM ANSWER

 * mysql://stu1900012992:***@162.105.146.37:43306
3 rows affected.

[('照射', 0.256425891682003),
 ('摇晃', 0.3219280948873623),
 ('盐水', 0.5567796494470394)]

In [13]:
%sql drop table Egg;
%sql drop table ANSWER;
%sql drop function LO;
%sql drop function F;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.
 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

## 练习五 关联分析中的频繁项发现

In [1]:
%load_ext sql
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu1900012989:stu1900012989@162.105.146.37:43306
%sql use stu1900012989;

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.

[]

### 数据预处理
* 对购物数据集中出现的商品进行计数，并存储在表格中
* 设置最小支持度为100，打印1阶频繁项集

In [2]:
%%sql
drop table if exists frequent_item1;
CREATE TABLE frequent_item1
(
    t_id INT PRIMARY KEY,
    item CHAR(60) NOT NULL,
    sup_val INT NOT NULL
);

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [3]:
%%sql
insert into frequent_item1(t_id,item,sup_val) values(0,'Telur',(select count(*) from dataset.supermarketTrans where Items like '%%Telur%%'));
insert into frequent_item1(t_id,item,sup_val) values(1,'Minyak',(select count(*) from dataset.supermarketTrans where Items like '%%Minyak%%'));
insert into frequent_item1(t_id,item,sup_val) values(2,'Kecap',(select count(*) from dataset.supermarketTrans where Items like '%%Kecap%%'));
insert into frequent_item1(t_id,item,sup_val) values(3,'Tepung',(select count(*) from dataset.supermarketTrans where Items like '%%Tepung%%'));
insert into frequent_item1(t_id,item,sup_val) values(4,'Susu',(select count(*) from dataset.supermarketTrans where Items like '%%Susu%%'));
insert into frequent_item1(t_id,item,sup_val) values(5,'Sabun',(select count(*) from dataset.supermarketTrans where Items like '%%Sabun%%'));
insert into frequent_item1(t_id,item,sup_val) values(6,'Snack',(select count(*) from dataset.supermarketTrans where Items like '%%Snack%%'));
insert into frequent_item1(t_id,item,sup_val) values(7,'Permen',(select count(*) from dataset.supermarketTrans where Items like '%%Permen%%'));
insert into frequent_item1(t_id,item,sup_val) values(8,'Deterjen',(select count(*) from dataset.supermarketTrans where Items like '%%Deterjen%%'));

 * mysql://stu1900012989:***@162.105.146.37:43306
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### 打印一阶频繁项集

In [4]:
%%sql
with tbl as (select * from frequent_item1 where sup_val >= 100)
select * from tbl;

 * mysql://stu1900012989:***@162.105.146.37:43306
9 rows affected.

[(0, 'Telur', 255),
 (1, 'Minyak', 232),
 (2, 'Kecap', 182),
 (3, 'Tepung', 238),
 (4, 'Susu', 162),
 (5, 'Sabun', 173),
 (6, 'Snack', 178),
 (7, 'Permen', 176),
 (8, 'Deterjen', 164)]

### 生成二阶频繁项集
* 利用Apriori法则，二阶频繁项集所包含的一阶项集一定是频繁项集
* 建立一个procedure，提供1个参数最小支持度，采用二重循环的方式，任取一阶频繁项集中的任意两行生成一个二阶项集，再统计这个二阶项集出现的次数来判断其是否为频繁项集
* 采用模糊查询：like+模式字符串的方式来统计项集出现次数

In [5]:
%%sql
drop table if exists frequent_item2;
CREATE TABLE frequent_item2
(
    t_id INT PRIMARY KEY,
    item CHAR(120) NOT NULL,
    sup_val INT NOT NULL
);

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql
drop procedure if exists find_frequent_item2;
create procedure find_frequent_item2(min_sup int)
begin
    declare i,j,tot,sup_val int;
    set i = 0;
    set tot = 0;
    while i<=3 do
        set j = i+1;
        while j <= 3 do
            set @item := CONCAT((select item from frequent_item1 where t_id=i),',',(select item from frequent_item1 where t_id=j));
            set @query := CONCAT('%%',(select item from frequent_item1 where t_id=i),'%%,%%',(select item from frequent_item1 where t_id=j),'%%');
            set sup_val = (select count(*) from dataset.supermarketTrans where Items like @query);
            if sup_val >= min_sup then
                insert into frequent_item2(t_id,item,sup_val) values(tot,@item,sup_val);
            end if;
            set tot = tot+1;
            set j = j+1;
        end while;
        set i = i+1;
    end while;
end

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [7]:
%%sql
drop procedure if exists update_frequent_item2;
create procedure update_frequent_item2()
begin
    declare i,tot int;
    set i = 0;
    set tot = 0;
    while i<=20 do
        if (select count(*) from frequent_item2 where t_id=i)>0 then
            update frequent_item2 set t_id=tot where t_id=i;
            set tot = tot+1;
        end if;
        set i = i+1;
    end while;
end

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

### 打印二阶频繁项集

In [8]:
%%sql
call find_frequent_item2(100);
call update_frequent_item2();
select * from frequent_item2;

 * mysql://stu1900012989:***@162.105.146.37:43306
1 rows affected.
1 rows affected.
6 rows affected.

[(0, 'Telur,Minyak', 201),
 (1, 'Telur,Kecap', 129),
 (2, 'Telur,Tepung', 198),
 (3, 'Minyak,Kecap', 125),
 (4, 'Minyak,Tepung', 184),
 (5, 'Kecap,Tepung', 120)]

### 生成三阶频繁项集
* 原理与生成二阶频繁项集相同；采用二重循环的方式，任取一阶频繁项集中的任意一行和二阶频繁项集中的任意一行，生成一个三阶项集，再统计这个三阶项集出现的次数来判断其是否为频繁项集

In [9]:
%%sql
drop table if exists frequent_item3;
CREATE TABLE frequent_item3
(
    t_id INT PRIMARY KEY,
    item CHAR(180) NOT NULL,
    sup_val INT NOT NULL
);

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
drop procedure if exists find_frequent_item3;
create procedure find_frequent_item3(min_sup int)
begin
    declare i,j,tot,sup_val int;
    set i = 0;
    set tot = 0;
    while i<=3 do
        set j = i;
        while j <=5 do
            set @str1 := (select item from frequent_item1 where t_id=i);
            set @str2 := (select item from frequent_item2 where t_id=j);
            set @item := CONCAT(@str1,',',@str2);
            set @query1 := CONCAT('%%',@str1,'%%');
            set @query2 := CONCAT('%%',substring_index(@str2,',',1),'%%,%%',substring_index(@str2,',',-1),'%%');
            set sup_val = (select count(*) from dataset.supermarketTrans where Items like @query1 and Items like @query2);
            if sup_val >= min_sup and find_in_set(@str1,@str2) = 0 then
                insert into frequent_item3(t_id,item,sup_val) values(tot,@item,sup_val);
            end if;
            set tot = tot+1;
            set j = j+1;
        end while;
        set i = i+1;
    end while;
end

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [11]:
%%sql
drop procedure if exists update_frequent_item3;
create procedure update_frequent_item3()
begin
    declare i,tot int;
    set i = 0;
    set tot = 0;
    while i<=20 do
        if (select count(*) from frequent_item3 where t_id=i)>0 then
            update frequent_item3 set t_id=tot where t_id=i;
            set tot = tot+1;
        end if;
        set i = i+1;
    end while;
end

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [12]:
%%sql 
call find_frequent_item3(100);
call update_frequent_item3();

 * mysql://stu1900012989:***@162.105.146.37:43306
0 rows affected.
1 rows affected.

[]

### 打印三阶频繁项集

In [13]:
%%sql
select * from frequent_item3;

 * mysql://stu1900012989:***@162.105.146.37:43306
6 rows affected.

[(0, 'Telur,Minyak,Kecap', 105),
 (1, 'Telur,Minyak,Tepung', 170),
 (2, 'Telur,Kecap,Tepung', 100),
 (3, 'Minyak,Telur,Kecap', 105),
 (4, 'Minyak,Telur,Tepung', 170),
 (5, 'Kecap,Telur,Tepung', 100)]